Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Pseudolocales are useful to find strings that are not prepared for localization. This is done by altering all translatable source strings to make it easy to spot unaltered strings when running the application in the pseudolocale language.
sv: Pseudolokaler Ã¤r anvÃ¤ndbara fÃ¶r att hitta strÃ¤ngar som inte Ã¤r fÃ¶rberedda fÃ¶r lokalisering. Detta gÃ¶rs genom att Ã¤ndra alla Ã¶versÃ¤ttningsbara kÃ¤llstrÃ¤ngar sÃ¥ att det blir lÃ¤tt att upptÃ¤cka ofÃ¶rÃ¤ndrade strÃ¤ngar nÃ¤r applikationen kÃ¶rs pÃ¥ pseudolokalens sprÃ¥k.

source: Finding strings whose localized counterparts might not fit the layout is also possible.
sv: Det Ã¤r ocksÃ¥ mÃ¶jligt att hitta strÃ¤ngar vars lokaliserade motsvarigheter kanske inte passar in i layouten.

source: Using the variable parts makes it possible to look for strings which might not fit into the user interface after the localization - it extends the text based on the source string length. The variable texts are repeated by length of the text multiplied by the multiplier. For example ``Hello world`` with variable text ``_`` and variable multiplier of 1 becomes ``Hello world___________`` - the text is repeated once for each character in the source string.
sv: Genom att anvÃ¤nda variablerna kan man sÃ¶ka efter strÃ¤ngar som kanske inte passar in i anvÃ¤ndargrÃ¤nssnittet efter lokaliseringen â det fÃ¶rlÃ¤nger texten baserat pÃ¥ kÃ¤llstrÃ¤ngens lÃ¤ngd. De variabla texterna upprepas med textens lÃ¤ngd multiplicerad med multiplikatorn. Till exempel blir ``Hello world`` med variabeltext ``_`` och variabel multiplikator 1 ``Hello world___________`` â texten upprepas en gÃ¥ng fÃ¶r varje tecken i kÃ¤llstrÃ¤ngen.

source: :guilabel:`Prepended static text` :guilabel:`Prepended variable text` :guilabel:`Source string` :guilabel:`Appended variable text` :guilabel:`Appended static text`
sv: :guilabel:`FÃ¶rinstÃ¤lld statisk text` :guilabel:`FÃ¶rinstÃ¤lld variabel text` :guilabel:`KÃ¤llstrÃ¤ng` :guilabel:`Tillagd variabel text` :guilabel:`Tillagd statisk text`

source: You can use real languages for testing, but there are dedicated pseudolocales available in Weblate - `en_XA` and `ar_XB`.
sv: Du kan anvÃ¤nda riktiga sprÃ¥k fÃ¶r testning, men det finns sÃ¤rskilda pseudolokaler tillgÃ¤ngliga i Weblate â `en_XA` och `ar_XB`.

source: You can use this add-on to start translation to a new locale of an existing language or similar language. Once you add the translation to the component, follow to the add-on. *Example:* If you have `fr` and want to start `fr_CA` translation, simply set `fr` as the source, `fr_CA` as the target, and leave the prefix and suffix blank.
sv: Du kan anvÃ¤nda detta tillÃ¤gg fÃ¶r att starta Ã¶versÃ¤ttning till en ny lokal av ett befintligt sprÃ¥k eller ett liknande sprÃ¥k. NÃ¤r du har lagt till Ã¶versÃ¤ttningen till komponenten fÃ¶ljer du tillÃ¤gget. *Exempel:* Om du har `fr` och vill starta Ã¶versÃ¤ttningen av `fr_CA`, anger du helt enkelt `fr` som kÃ¤lla, `fr_CA` som mÃ¥l och lÃ¤mnar prefixet och suffixet tomma.

source: Uninstall the add-on once you have the new translation filled to prevent Weblate from changing the translations made after the copying.
sv: Avinstallera tillÃ¤gget nÃ¤r du har fyllt i den nya Ã¶versÃ¤ttningen fÃ¶r att fÃ¶rhindra att Weblate Ã¤ndrar Ã¶versÃ¤ttningarna som gjorts efter kopieringen.

source: The PO file header will look like this:
sv: PO-filens rubrik kommer att se ut sÃ¥ hÃ¤r:

source: Updates the ALL_LINGUAS variable in :file:`configure`, :file:`configure.in` or any :file:`configure.ac` files, when a new translation is added.
sv: Uppdaterar variabeln ALL_LINGUAS i :file:`configure`, :file:`configure.in` eller alla :file:`configure.ac`-filer nÃ¤r en ny Ã¶versÃ¤ttning lÃ¤ggs till.

source: Customize gettext output
sv: Anpassa gettext-utmatning

source: Replaced by :ref:`file_format_params`.
sv: Ersatt av :ref:`file_format_params`.

source: The location of the generated MO file can be customized and the field for it uses :ref:`markup`.
sv: Platsen fÃ¶r den genererade MO-filen kan anpassas och fÃ¤ltet fÃ¶r den anvÃ¤nder :ref:`markup`.

source: If a translation is removed, its PO file will be deleted from the repository, but the MO file generated by this add-on will not. The MO file must be removed from the upstream manually.
sv: Om en Ã¶versÃ¤ttning tas bort kommer dess PO-fil att raderas frÃ¥n arkivet, men inte MO-filen som genererats av detta tillÃ¤gg. MO-filen mÃ¥ste tas bort manuellt frÃ¥n uppstrÃ¶ms.

source: :guilabel:`Settings` configuration has been moved to :ref:`file_format_params`.
sv: :guilabel:`InstÃ¤llningar`-konfigurationen har flyttats till :ref:`file_format_params`.

source: Updates all PO files (as configured by :ref:`component-filemask`) to match the POT file (as configured by :ref:`component-new_base`) using :program:`msgmerge`.
sv: Uppdaterar alla PO-filer (enligt konfigurationen i :ref:`component-filemask`) sÃ¥ att de matchar POT-filen (enligt konfigurationen i :ref:`component-new_base`) med hjÃ¤lp av :program:`msgmerge`.

source: This add-on is essential when working with gettext PO files where the POT (template) file is updated with new strings or changes to existing strings. When the POT file is updated in the repository, this add-on automatically merges those changes into all language PO files, ensuring that:
sv: Detta tillÃ¤gg Ã¤r viktigt nÃ¤r du arbetar med gettext PO-filer dÃ¤r POT-filen (mallen) uppdateras med nya strÃ¤ngar eller Ã¤ndringar av befintliga strÃ¤ngar. NÃ¤r POT-filen uppdateras i arkivet sammanfogar detta tillÃ¤gg automatiskt dessa Ã¤ndringar i alla sprÃ¥k-PO-filer, vilket sÃ¤kerstÃ¤ller att:

source: New translatable strings appear in all languages
sv: Nya Ã¶versÃ¤ttningsbara strÃ¤ngar visas pÃ¥ alla sprÃ¥k

source: Removed strings are marked as obsolete
sv: Borttagna strÃ¤ngar markeras som fÃ¶rÃ¥ldrade

source: Modified strings are marked as needing review (fuzzy)
sv: Modifierade strÃ¤ngar markeras som behÃ¶ver granskas (fuzzy)

source: Most msgmerge command-line options can be set up through file format parameters configuration.
sv: De flesta kommandoradsalternativ fÃ¶r msgmerge kan konfigureras genom att stÃ¤lla in parametrar fÃ¶r filformat.

source: To avoid unnecessary conflicts, it is recommended to configure automatic receiving of upstream changes by webhooks or API, see :ref:`update-vcs`.
sv: FÃ¶r att undvika onÃ¶diga konflikter rekommenderas det att konfigurera automatisk mottagning av uppstrÃ¶msÃ¤ndringar via webhooks eller API, se :ref:`update-vcs`.

source: Git commits can be squashed prior to pushing changes in one of the following modes:
sv: Git-commits kan squashas innan Ã¤ndringarna pushas i nÃ¥got av fÃ¶ljande lÃ¤gen:

source: Original commit messages are kept, but authorship is lost unless :guilabel:`Per author` is selected, or the commit message is customized to include it.
sv: Originalcommit-meddelanden behÃ¥lls, men upphovsmannaskapet gÃ¥r fÃ¶rlorat om inte :guilabel:`Per author` Ã¤r valt eller om commit-meddelandet anpassas sÃ¥ att det inkluderar det.

source: The original commit messages can optionally be overridden with a custom commit message.
sv: De ursprungliga commit-meddelandena kan valfritt ersÃ¤ttas med ett anpassat commit-meddelande.

source: Trailers (commit lines like ``Co-authored-by: â¦``) can optionally be removed from the original commit messages and appended to the end of the squashed commit message. This also generates proper ``Co-authored-by:`` credit for every translator.
sv: Trailers (commit-rader som ``Co-authored-by: â¦``) kan valfritt tas bort frÃ¥n de ursprungliga commit-meddelandena och lÃ¤ggas till i slutet av det sammanslagna commit-meddelandet. Detta genererar ocksÃ¥ korrekt ``Co-authored-by:``-kreditering fÃ¶r varje Ã¶versÃ¤ttare.

source: Customize JSON output
sv: Anpassa JSON-utmatning

source: :guilabel:`Avoid spaces after separators` option added.
sv: Alternativet :guilabel:`Undvik mellanslag efter separatorer` har lagts till.

source: Consolidates newlines to Unix ones.
sv: Konsoliderar radbrytningar till Unix-radbrytningar.

source: Uppercase formatting of Unicode escape sequences (in case they are present).
sv: Formatering av Unicode-eskapsekvenser med versaler (om sÃ¥dana fÃ¶rekommer).

source: Strips blank lines and comments.
sv: Tar bort tomma rader och kommentarer.

source: Sorts the strings by the keys.
sv: Sorterar strÃ¤ngarna efter nycklarna.

source: Drops duplicate strings.
sv: Tar bort dubbla strÃ¤ngar.

source: This can be useful to remove old comments which might have become outdated. Use with care as comments getting old does not mean they have lost their importance.
sv: Detta kan vara anvÃ¤ndbart fÃ¶r att ta bort gamla kommentarer som kan ha blivit inaktuella. AnvÃ¤nd med fÃ¶rsiktighet, eftersom gamla kommentarer inte nÃ¶dvÃ¤ndigtvis har fÃ¶rlorat sin betydelse.

source: Can be very useful in connection with suggestion voting (see :ref:`peer-review`) to remove suggestions which don't receive enough positive votes in a given timeframe.
sv: Kan vara mycket anvÃ¤ndbart i samband med omrÃ¶stning om fÃ¶rslag (se :ref:`peer-review`) fÃ¶r att ta bort fÃ¶rslag som inte fÃ¥r tillrÃ¤ckligt mÃ¥nga positiva rÃ¶ster inom en given tidsram.

source: Use :ref:`addon-weblate.cleanup.generic` if you only want to remove stale translation keys.
sv: AnvÃ¤nd :ref:`addon-weblate.cleanup.generic` om du bara vill ta bort gamla Ã¶versÃ¤ttningsnycklar.

source: The notification content might show HTML tags. This is a known issue that will be soon addressed; see https://github.com/WeblateOrg/weblate/issues/15056.
sv: Meddelandets innehÃ¥ll kan innehÃ¥lla HTML-taggar. Detta Ã¤r ett kÃ¤nt problem som snart kommer att Ã¥tgÃ¤rdas. Se https://github.com/WeblateOrg/weblate/issues/15056.

source: To obtain a webhook URL, follow the steps outlined in the `Slack Incoming Webhooks documentation <https://docs.slack.dev/messaging/sending-messages-using-incoming-webhooks>`_
sv: FÃ¶r att fÃ¥ en webhook-URL, fÃ¶lj stegen som beskrivs i dokumentationen fÃ¶r Slack Incoming Webhooks <https://docs.slack.dev/messaging/sending-messages-using-incoming-webhooks>_

source: Compliance of the secret length with the specification is now validated.
sv: SekretesslÃ¤ngdens Ã¶verensstÃ¤mmelse med specifikationen valideras nu.

source: The request payload complies with the :ref:`schema-messaging` schema. The OpenAPI description can also be found at ``/api/docs/``. Sample request body:
sv: BegÃ¤ranens nyttolast Ã¶verensstÃ¤mmer med :ref:`schema-messaging`-schemat. OpenAPI-beskrivningen finns ocksÃ¥ pÃ¥ ``/api/docs/``. Exempel pÃ¥ begÃ¤ran:

source: Sample request body with categories:
sv: Exempel pÃ¥ begÃ¤ran med kategorier:

source: Sample request headers:
sv: Exempel pÃ¥ begÃ¤ranrubriker:

source: The ``webhook-signature`` is a space separated list of HMAC signatures generated using the ``secret`` string, the request payload, the ``webhook-timestamp``, and the ``webhook-id``. This ensures the authenticity and integrity of the webhook request.
sv: ``webhook-signature`` Ã¤r en lista med HMAC-signaturer separerade med mellanslag som genereras med hjÃ¤lp av strÃ¤ngen ``secret``, begÃ¤ranens nyttolast, ``webhook-timestamp`` och ``webhook-id``. Detta sÃ¤kerstÃ¤ller Ã¤ktheten och integriteten hos webhook-begÃ¤ran.

source: The provided ``secret`` is a base64 encoded string between 24 bytes (192 bits) and 64 bytes (512 bits). It can be prefixed with ``whsec_`` for easy identification.
sv: Den angivna ``hemligheten`` Ã¤r en base64-kodad strÃ¤ng mellan 24 byte (192 bitar) och 64 byte (512 bitar). Den kan prefixeras med ``whsec_`` fÃ¶r enkel identifiering.

source: To verify a request, you can use the ``Webhook.verify`` method from the ``standardwebhooks`` library or an implementation of the "Standard Webhooks Specification".
sv: FÃ¶r att verifiera en begÃ¤ran kan du anvÃ¤nda metoden ``Webhook.verify`` frÃ¥n biblioteket ``standardwebhooks`` eller en implementering av "Standard Webhooks Specification".

source: `Python library for Standard Webhooks <https://pypi.org/project/standardwebhooks/>`_
sv: Python-bibliotek fÃ¶r standardwebhooks <https://pypi.org/project/standardwebhooks/>_

source: Customize XML output
sv: Anpassa XML-utdata

source: Customize YAML output
sv: Anpassa YAML-utmatning

source: Common add-on parameters
sv: Vanliga tillÃ¤ggsparametrar

source: Amazon Translate
sv: Amazon ÃversÃ¤tt

source: Weblate Translation Memory
sv: Weblate Ã¶versÃ¤ttningsminne

source: Multivalue CSV file (UTF-8)
sv: CSV-fil med flera vÃ¤rden (UTF-8)

source: Simple CSV file (ISO-8859-1)
sv: Simple CSV-fil (ISO-8859-1)

source: Simple CSV file (UTF-8)
sv: Enkel CSV-fil (UTF-8)

source: CSV file (UTF-8)
sv: CSV-fil (UTF-8)

source: GWT properties (UTF-8)
sv: GWT-egenskaper (UTF-8)

source: GWT properties (ISO-8859-1)
sv: GWT-egenskaper (ISO-8859-1)

source: iOS strings (UTF-16)
sv: iOS-strÃ¤ngar (UTF-16)

source: iOS strings (UTF-8)
sv: iOS-strÃ¤ngar (UTF-8)

source: XWiki Full Page
sv: XWiki Hela sidan

source: XWiki Java Properties
sv: XWiki Java-egenskaper

source: XWiki Page Properties
sv: XWiki-sidegenskaper

source: Customizing list of add-ons
sv: Anpassa lista Ã¶ver tillÃ¤gg

source: The list of add-ons is configured by :setting:`WEBLATE_ADDONS`. To add another add-on, simply include the absolute class name in this setting.
sv: Listan Ã¶ver tillÃ¤gg konfigureras med :setting:`WEBLATE_ADDONS`. FÃ¶r att lÃ¤gga till ett nytt tillÃ¤gg, ange bara det absoluta klassnamnet i denna instÃ¤llning.

source: Writing add-on
sv: Skriv tillÃ¤gg

source: You can write your own add-ons too, create a subclass of :class:`weblate.addons.base.BaseAddon` to define the add-on metadata, and then implement a callback to do the processing.
sv: Du kan ocksÃ¥ skriva egna tillÃ¤gg, skapa en underklass av :class:`weblate.addons.base.BaseAddon` fÃ¶r att definiera tillÃ¤ggets metadata och sedan implementera en Ã¥teranrop fÃ¶r att utfÃ¶ra bearbetningen.

source: Executing scripts from add-on
sv: KÃ¶rning av skript frÃ¥n tillÃ¤gg

source: Add-ons can also be used to execute external scripts. This used to be integrated in Weblate, but now you have to write some code to wrap your script with an add-on.
sv: TillÃ¤gg kan ocksÃ¥ anvÃ¤ndas fÃ¶r att kÃ¶ra externa skript. Detta var tidigare integrerat i Weblate, men nu mÃ¥ste du skriva lite kod fÃ¶r att omsluta ditt skript med ett tillÃ¤gg.

source: For installation instructions see :ref:`custom-addon-modules`.
sv: FÃ¶r installationsinstruktioner, se :ref:`custom-addon-modules`.

source: The script is executed with the current directory set to the root of the VCS repository for any given component.
sv: Skriptet kÃ¶rs med den aktuella katalogen instÃ¤lld pÃ¥ roten av VCS-arkivet fÃ¶r en given komponent.

source: Additionally, the following environment variables are available:
sv: Dessutom finns fÃ¶ljande miljÃ¶variabler tillgÃ¤ngliga:

source: Version control system used.
sv: AnvÃ¤nt versionshanteringssystem.

source: Upstream repository URL.
sv: Upstream-arkivets URL.

source: Absolute path to VCS repository.
sv: Absolut sÃ¶kvÃ¤g till VCS-arkivet.

source: Repository branch configured in the current component.
sv: Repository-gren konfigurerad i den aktuella komponenten.

source: File mask for current component.
sv: Filmask fÃ¶r aktuell komponent.

source: Filename of template for monolingual translations (can be empty).
sv: Filnamn pÃ¥ mall fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar (kan vara tomt).

source: Filename of the file used for creating new translations (can be empty).
sv: Filnamn pÃ¥ filen som anvÃ¤nds fÃ¶r att skapa nya Ã¶versÃ¤ttningar (kan vara tom).

source: File format used in current component.
sv: Filformat som anvÃ¤nds i aktuell komponent.

source: Language of currently processed translation (not available for component-level hooks).
sv: SprÃ¥k fÃ¶r den Ã¶versÃ¤ttning som fÃ¶r nÃ¤rvarande bearbetas (inte tillgÃ¤ngligt fÃ¶r komponenthookar).

source: Previous HEAD after update (only available after running the post-update hook).
sv: Tidigare HEAD efter uppdatering (endast tillgÃ¤ngligt efter att post-update-hooken har kÃ¶rts).

source: Component slug used to construct URL.
sv: Komponent slug som anvÃ¤nds fÃ¶r att konstruera URL.

source: Project slug used to construct URL.
sv: Projektnamn som anvÃ¤nds fÃ¶r att skapa URL.

source: Component name.
sv: Komponentens namn.

source: Project name.
sv: Projektnamn.

source: Component URL.
sv: Komponentens URL.

source: Project engage URL.
sv: Projektets engagemangs-URL.

source: Post-update repository processing
sv: Bearbetning av arkivet efter uppdatering

source: Can be used to update translation files when the VCS upstream source changes. To achieve this, please remember Weblate only sees files committed to the VCS, so you need to commit changes as a part of the script.
sv: Kan anvÃ¤ndas fÃ¶r att uppdatera Ã¶versÃ¤ttningsfiler nÃ¤r VCS-uppstrÃ¶ms kÃ¤llan Ã¤ndras. FÃ¶r att uppnÃ¥ detta, kom ihÃ¥g att Weblate endast ser filer som har lagts in i VCS, sÃ¥ du mÃ¥ste lÃ¤gga in Ã¤ndringarna som en del av skriptet.

source: For example with Gulp you can do it using following code:
sv: Med Gulp kan du till exempel gÃ¶ra det med fÃ¶ljande kod:

source: Pre-commit processing of translations
sv: FÃ¶rhandsgranskning av Ã¶versÃ¤ttningar

source: Use the commit script to automatically change a translation before it is committed to the repository.
sv: AnvÃ¤nd commit-skriptet fÃ¶r att automatiskt Ã¤ndra en Ã¶versÃ¤ttning innan den lÃ¤ggs in i arkivet.

source: It is passed as a single parameter consisting of the filename of a current translation.
sv: Den skickas som en enda parameter som bestÃ¥r av filnamnet pÃ¥ en aktuell Ã¶versÃ¤ttning.

source: Add-on activity logging
sv: Loggning av tillÃ¤ggsaktiviteter

source: Add-on activity log keeps track of the add-on execution and can be used to keep track of add-on activity.
sv: TillÃ¤ggsaktivitetsloggen hÃ¥ller reda pÃ¥ tillÃ¤ggets kÃ¶rning och kan anvÃ¤ndas fÃ¶r att hÃ¥lla reda pÃ¥ tillÃ¤ggsaktiviteten.

source: The logs can be pruned after a certain time interval by configuring the :setting:`ADDON_ACTIVITY_LOG_EXPIRY`.
sv: Loggarna kan rensas efter ett visst tidsintervall genom att konfigurera :setting:`ADDON_ACTIVITY_LOG_EXPIRY`.

source: Management interface
sv: HanteringsgrÃ¤nssnitt

source: The management interface offer administration settings under the :file:`/manage/` URL. It is available for users signed in with admin privileges, accessible by using the wrench icon top right:
sv: AdministrationsgrÃ¤nssnittet erbjuder administrationsinstÃ¤llningar under URL:en :file:`/manage/`. Det Ã¤r tillgÃ¤ngligt fÃ¶r anvÃ¤ndare som Ã¤r inloggade med administratÃ¶rsbehÃ¶righet och nÃ¥s genom att klicka pÃ¥ skiftnyckelikonen lÃ¤ngst upp till hÃ¶ger:

source: It includes basic overview of your Weblate:
sv: Den innehÃ¥ller en grundlÃ¤ggande Ã¶versikt Ã¶ver din Weblate:

source: Support status, see :doc:`support`.
sv: Supportstatus, se :doc:`support`.

source: Backups, see :doc:`backup`.
sv: SÃ¤kerhetskopior, se :doc:`backup`.

source: Shared translation memory, see :doc:`memory`.
sv: Delat Ã¶versÃ¤ttningsminne, se :doc:`memory`.

source: :ref:`manage-performance` to review Weblate health and length of Celery queues.
sv: :ref:`manage-performance` fÃ¶r att granska Weblates hÃ¤lsa och lÃ¤ngden pÃ¥ Celery-kÃ¶erna.

source: SSH keys management, see :ref:`ssh-repos`.
sv: SSH-nyckelhantering, se :ref:`ssh-repos`.

source: Alerts overview for all components, see :ref:`alerts`.
sv: Ãversikt Ã¶ver varningar fÃ¶r alla komponenter, se :ref:`alerts`.

source: Users and teams, see :ref:`custom-acl`.
sv: AnvÃ¤ndare och team, se :ref:`custom-acl`.

source: Configure :ref:`machine-translation-setup`.
sv: Konfigurera :ref:`machine-translation-setup`.

source: Configure site-wide addons, see :ref:`addons`.
sv: Konfigurera tillÃ¤gg fÃ¶r hela webbplatsen, se :ref:`addons`.

source: This page provides an overview of Weblate configuration and performance status.
sv: Denna sida ger en Ã¶versikt Ã¶ver Weblates konfiguration och prestandastatus.

source: :guilabel:`Configuration errors` indicate issues present in your environment. It covers missing optional dependencies (see :ref:`python-deps`), configuration issues or delayed processing of background tasks (see :ref:`celery`).
sv: :guilabel:`Konfigurationsfel` indikerar problem i din miljÃ¶. Det omfattar saknade valfria beroenden (se :ref:`python-deps`), konfigurationsproblem eller fÃ¶rdrÃ¶jd bearbetning av bakgrundsuppgifter (se :ref:`celery`).

source: :guilabel:`System checks` lists possible configuration issues. These can be silenced using :setting:`django:SILENCED_SYSTEM_CHECKS`, see also :doc:`django:howto/deployment/checklist`.
sv: :guilabel:`Systemkontroller` listar mÃ¶jliga konfigurationsproblem. Dessa kan tystas med hjÃ¤lp av :setting:`django:SILENCED_SYSTEM_CHECKS`, se Ã¤ven :doc:`django:howto/deployment/checklist`.

source: :guilabel:`Celery queues` provides overview of Celery queues. These typically should be close to zero. The same can be obtained on the command line using :wladmin:`celery_queues`.
sv: :guilabel:`Celery-kÃ¶er` ger en Ã¶versikt Ã¶ver Celery-kÃ¶er. Dessa bÃ¶r normalt sett vara nÃ¤ra noll. Samma information kan erhÃ¥llas pÃ¥ kommandoraden med hjÃ¤lp av :wladmin:`celery_queues`.

source: :guilabel:`HTTP environment` allows you to see HTTP environment observed by Weblate. This is useful when debugging reverse proxy configuration, see :ref:`reverse-proxy`. :guilabel:`HTTP headers` shows complete HTTP request headers to provide additional information.
sv: :guilabel:`HTTP-miljÃ¶` lÃ¥ter dig se HTTP-miljÃ¶n som observerats av Weblate. Detta Ã¤r anvÃ¤ndbart vid felsÃ¶kning av omvÃ¤nd proxykonfiguration, se :ref:`reverse-proxy`. :guilabel:`HTTP-rubriker` visar kompletta HTTP-fÃ¶rfrÃ¥gningsrubriker fÃ¶r att ge ytterligare information.

source: :guilabel:`System encoding` should list ``UTF-8`` encoding in all processes. This needs to be configured in your system, see :ref:`production-encoding`.
sv: :guilabel:`Systemkodning` bÃ¶r ange ``UTF-8``-kodning i alla processer. Detta mÃ¥ste konfigureras i ditt system, se :ref:`production-encoding`.

source: :guilabel:`Connectivity` shows latencies to the database, cache, and Celery. This might be useful to diagnose connectivity issues.
sv: :guilabel:`Anslutning` visar fÃ¶rdrÃ¶jningar till databasen, cachen och Celery. Detta kan vara anvÃ¤ndbart fÃ¶r att diagnostisera anslutningsproblem.

source: Appearance customization
sv: Anpassning av utseende

source: The colors are currently used in both dark and light theme, so be careful when choosing them.
sv: FÃ¤rgerna anvÃ¤nds fÃ¶r nÃ¤rvarande i bÃ¥de mÃ¶rka och ljusa teman, sÃ¥ var fÃ¶rsiktig nÃ¤r du vÃ¤ljer dem.

source: Colors, fonts, and page appearance can be customized here.
sv: FÃ¤rger, typsnitt och sidans utseende kan anpassas hÃ¤r.

source: If you are looking for more customization, see :doc:`/admin/customize`.
sv: Om du vill ha fler anpassningsmÃ¶jligheter, se :doc:`/admin/customize`.

source: The Django admin interface
sv: Djangos administratÃ¶rsgrÃ¤nssnitt

source: Use with caution as this is a low level interface. You should not need it in most cases as most things are comfortably approachable through Weblate UI or API.
sv: AnvÃ¤nd med fÃ¶rsiktighet eftersom detta Ã¤r ett grÃ¤nssnitt pÃ¥ lÃ¥g nivÃ¥. I de flesta fall bÃ¶r du inte behÃ¶va det, eftersom det mesta Ã¤r lÃ¤ttillgÃ¤ngligt via Weblate UI eller API.

source: Here you can manage objects stored in the database, such as users, translations and other settings:
sv: HÃ¤r kan du hantera objekt som lagras i databasen, sÃ¥som anvÃ¤ndare, Ã¶versÃ¤ttningar och andra instÃ¤llningar:
